{"class_name": "Functional", "config": {"name": "g", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 640, 640, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs4"}, "name": "inputs4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv1c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1c", "inbound_nodes": [[["inputs4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv1b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv1b", "inbound_nodes": [[["conv1c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv1a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv1a", "inbound_nodes": [[["conv1b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1c2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1c2", "inbound_nodes": [[["conv1a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv1b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv1b2", "inbound_nodes": [[["conv1c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv1a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv1a2", "inbound_nodes": [[["conv1b2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "conv1m", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "conv1m", "inbound_nodes": [[["conv1a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2c", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2c", "inbound_nodes": [[["conv1m", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2b", "inbound_nodes": [[["conv2c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv2a", "inbound_nodes": [[["conv2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2c2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2c2", "inbound_nodes": [[["conv2a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv2b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv2b2", "inbound_nodes": [[["conv2c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv2a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv2a2", "inbound_nodes": [[["conv2b2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "conv2m", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "conv2m", "inbound_nodes": [[["conv2a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3c", "inbound_nodes": [[["conv2m", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3b", "inbound_nodes": [[["conv3c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv3a", "inbound_nodes": [[["conv3b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3c2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3c2", "inbound_nodes": [[["conv3a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv3b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv3b2", "inbound_nodes": [[["conv3c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv3a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv3a2", "inbound_nodes": [[["conv3b2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "conv3m", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "conv3m", "inbound_nodes": [[["conv3a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4c", "inbound_nodes": [[["conv3m", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4b", "inbound_nodes": [[["conv4c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv4a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv4a", "inbound_nodes": [[["conv4b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv4c2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv4c2", "inbound_nodes": [[["conv4a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv4b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv4b2", "inbound_nodes": [[["conv4c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv4a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv4a2", "inbound_nodes": [[["conv4b2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "conv4m", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "conv4m", "inbound_nodes": [[["conv4a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv5c", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv5c", "inbound_nodes": [[["conv4m", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv5b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv5b", "inbound_nodes": [[["conv5c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv5a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv5a", "inbound_nodes": [[["conv5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv5c2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv5c2", "inbound_nodes": [[["conv5a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv5b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv5b2", "inbound_nodes": [[["conv5c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv5a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv5a2", "inbound_nodes": [[["conv5b2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up1", "inbound_nodes": [[["conv5a2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv6cat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "conv6cat", "inbound_nodes": [[["up1", 0, 0, {}], ["conv4a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv6c", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv6c", "inbound_nodes": [[["conv6cat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv6b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv6b", "inbound_nodes": [[["conv6c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv6a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv6a", "inbound_nodes": [[["conv6b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv6c2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv6c2", "inbound_nodes": [[["conv6a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv6b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv6b2", "inbound_nodes": [[["conv6c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv6a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv6a2", "inbound_nodes": [[["conv6b2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up2", "inbound_nodes": [[["conv6a2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv7cat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "conv7cat", "inbound_nodes": [[["up2", 0, 0, {}], ["conv3a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv7c", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv7c", "inbound_nodes": [[["conv7cat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv7b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv7b", "inbound_nodes": [[["conv7c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv7a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv7a", "inbound_nodes": [[["conv7b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv7c2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv7c2", "inbound_nodes": [[["conv7a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv7b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv7b2", "inbound_nodes": [[["conv7c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv7a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv7a2", "inbound_nodes": [[["conv7b2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up3", "inbound_nodes": [[["conv7a2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv8cat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "conv8cat", "inbound_nodes": [[["up3", 0, 0, {}], ["conv2a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv8c", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv8c", "inbound_nodes": [[["conv8cat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv8b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv8b", "inbound_nodes": [[["conv8c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv8a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv8a", "inbound_nodes": [[["conv8b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv8c2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv8c2", "inbound_nodes": [[["conv8a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv8b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv8b2", "inbound_nodes": [[["conv8c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv8a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv8a2", "inbound_nodes": [[["conv8b2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up4", "inbound_nodes": [[["conv8a2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "conv9cat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "conv9cat", "inbound_nodes": [[["up4", 0, 0, {}], ["conv1a2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv9c", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv9c", "inbound_nodes": [[["conv9cat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv9b", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv9b", "inbound_nodes": [[["conv9c", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv9a", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv9a", "inbound_nodes": [[["conv9b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv9c2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv9c2", "inbound_nodes": [[["conv9a", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv9b2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv9b2", "inbound_nodes": [[["conv9c2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "conv9a2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "conv9a2", "inbound_nodes": [[["conv9b2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "outputs4", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "outputs4", "inbound_nodes": [[["conv9a2", 0, 0, {}]]]}], "input_layers": [["inputs4", 0, 0]], "output_layers": [["outputs4", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}